#include "ite/ith.h"
#include "jpg_defs.h"
#include "jpg_hw.h"
#include "jpg_extern_link.h"
//=============================================================================
//                  Constant Definition
//=============================================================================
//#define JPG_REGS_USE_CMDQ 0
bool b_JPG_REGS_USE_CMDQ = false;

//=============================================================================
//                  Macro Definition
//=============================================================================

//=============================================================================
//                  Structure Definition
//=============================================================================

#define JPG_HW_REG uint32_t

typedef struct _JPG_HW_REGS
{
    JPG_HW_REG  reg0;       ///< 0x00
    JPG_HW_REG  reg1;       ///< 0x04
    JPG_HW_REG  reg2;       ///< 0x08
    JPG_HW_REG  reg3;       ///< 0x0C
    JPG_HW_REG  reg4;       ///< 0x10
    JPG_HW_REG  reg5;       ///< 0x14
    JPG_HW_REG  reg6;       ///< 0x18
    JPG_HW_REG  reg7;       ///< 0x1C
    JPG_HW_REG  reg8;       ///< 0x20
    JPG_HW_REG  reg9;       ///< 0x24
    JPG_HW_REG  reg10;      ///< 0x28
    JPG_HW_REG  reg11;      ///< 0x2C
    JPG_HW_REG  reg12;      ///< 0x6C
    JPG_HW_REG  reg13;      ///< 0xAC
    JPG_HW_REG  reg14;      ///< 0xEC
    JPG_HW_REG  reg15;      ///< 0xFO
    JPG_HW_REG  reg16;      ///< 0xF4
    JPG_HW_REG  reg17;      ///< 0xF8
    JPG_HW_REG  reg18;      ///< 0xFC
    JPG_HW_REG  reg19;      ///< 0x100
    JPG_HW_REG  reg20;      ///< 0x104
    JPG_HW_REG  reg21;      ///< 0x108
    JPG_HW_REG  reg22;      ///< 0x10C
    JPG_HW_REG  reg23;      ///< 0x110
    JPG_HW_REG  reg24;      ///< 0x1000
    JPG_HW_REG  reg25;      ///< 0x1004
    JPG_HW_REG  reg26;      ///< 0x1008
    JPG_HW_REG  reg27;      ///< 0x100C
    JPG_HW_REG  reg28;      ///< 0x1010
    JPG_HW_REG  reg29;      ///< 0x1014
    JPG_HW_REG  reg30;      ///< 0x1018
    JPG_HW_REG  reg31;      ///< 0x101C
    JPG_HW_REG  reg32;      ///< 0x1020
}JPG_HW_REGS;

//=============================================================================
//                  Global Data Definition
//=============================================================================

JPG_HW_REGS jpg_regs = {0};

uint32_t jpgCompCtrl[5] =
{
    0,
    JPG_MSK_LINE_BUF_COMPONENT_1_VALID,
    (JPG_MSK_LINE_BUF_COMPONENT_1_VALID | JPG_MSK_LINE_BUF_COMPONENT_2_VALID),
    (JPG_MSK_LINE_BUF_COMPONENT_1_VALID | JPG_MSK_LINE_BUF_COMPONENT_2_VALID | JPG_MSK_LINE_BUF_COMPONENT_3_VALID),
    (JPG_MSK_LINE_BUF_COMPONENT_1_VALID | JPG_MSK_LINE_BUF_COMPONENT_2_VALID | JPG_MSK_LINE_BUF_COMPONENT_3_VALID | JPG_MSK_LINE_BUF_COMPONENT_4_VALID)
};

JPG_YUV_TO_RGB yuv2RgbMatrix =
{
	0x0100, // _11
	0x015f, // _13
	0x0100, // _21
	0x07aa, // _22
	0x074d, // _23
	0x0100, // _31
	0x01bb, // _32
	0x0351, // ConstR
	0x0084, // ConstG
	0x0322, // ConstB
	0,      // Reserved
	0,	    // Vip mode = RGB565
};

